posts/2019-01-06-welcome-to-my-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-04 Sat 21:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Welcome to my Blog!</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Eric Nguyen">
<link rel="icon" href="/favicon.ico"><link rel="stylesheet" type="text/css" href="/assets/css/main.css">
</head>
<body>
<div id="preamble" class="status">
<nav><p>Navigation: <a href="/index.html">Home</a> <a href="/archive.html">Blog</a> <a href="/about.html">About</a> <a href="/contact.html">Contact</a> </nav>
</div>
<div id="content">
<header>
<h1 class="title">Welcome to my Blog!</h1>
</header><p>
Here, I plan to post about whatever I feel like writing about.
Some things you should know about me is that I enjoy learning about computer programming and mathematics.
</p>

<p>
With regards to programming, my best skills are making static websites with HTML, CSS, and JS, but I have done a little bit of work with Node.js.
In addition to web development, I also have some experience in using data science languages Python, R, and Julia which I use primarily for my math and statistics homework.
</p>

<p>
Right now, I’m taking a Calculus course in high school, which admittedly is not too advanced, but it is really interesting! Also, I’m the only student in the class which makes the learning experience really amazing.
I haven’t yet gotten to learning about integrals, but I’m looking forward to it as I really need to learn integration to solve differential equations, which is another topic I’m interested in learning more about.
</p>

<p>
For my hobbies, I like to dance, listen to music, and play video games.
</p>

<p>
Recently, I started playing Destiny 2 and from my experience, I think it’s a great game.
My favorite part about it is how satisfying the combat feels.
Other games I currently like to play are Overwatch, League of Legends, and Team Fortress 2.
I recently got a new laptop, the Lenovo Yoga 730 15″, that has much more storage and processing power than the previous, so now I can play more games! One problem that I’ve noticed with this new laptop is that it freezes when the GPU isn’t being used, but fortunately that problem has mostly been resolved after performing a factory reset on the machine.
</p>

<p>
I don’t really know too much about music, but the main genres I listen to are hip-hop and K-pop.
I especially enjoy music that I can dance to.
Some of my favorite artists include TWICE, IU, SUNMI, BOL4, and BTS.
I recently started streaming music through Spotify, so I have been listening to a much more diverse set of tracks, compared to when I would simply download my favorite music off of YouTube.
</p>

<p>
As for dance, I started out by dancing to Skrillex’s music back in grade school. Now, I primarily do b-boying and K-pop choreography.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-26</p>
<p class="author">Author: Eric Nguyen</p>
<p class="email">Email: <a href="mailto:tuk94307@temple.edu">tuk94307@temple.edu</a></p>
<p class="date">Created: 2020-01-04 Sat 21:35</p>
</div>
</body>
</html>
